Revit 2025 API
Zone.Volume Property
Get the Volume of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
public:
property double Volume {
	double get ();
}
member Volume : float with get
Property Value
Double
Remarks
This property is used to get the Volume of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace